#!/usr/bin/gnuplot

# original formulas from the paper

KG(t,vm) = \
  t<0.05? 1/t/(\
 1/(- 4.1884746e1\
    + 1.9262839 * vm)\
 + t/(- 1.8546379\
      + 2.3695190e-1 *vm\
      - 6.8284756e-3 *vm**2)\
 + t**2/(+ 4.3617792e-1\
         - 4.2101673e-2 *vm\
         + 1.0050221e-3 *vm**2)\
 + t**3/(- 9.4328296e-2\
         + 8.9196267e-3 *vm\
         - 2.0903165e-4 *vm**2) ):\
 (\
 + 2.5498997    / t**2\
 - 1.1861905e-1 / t**2 * vm\
 + 1.7187787e-3 / t**2 * vm**2\
 - 1.4861472e2  / t\
 + 7.2176329    / t * vm\
 - 7.5439157e-2 / t * vm**2\
 + 1.0311239e3\
 - 4.1084636e1  *vm\
 + 6.8188534e-1 *vm**2\
 - 3.3746517e3  *t\
 + 2.2612612e2  *t *vm\
 - 3.4207801    *t *vm**2\
 + 2.5913792e3  *t**2\
 - 1.4574998e2  *t**2 *vm\
 + 2.1389643    *t**2 *vm**2\
 )

# Dyugaev-1985

TK(p) = 0.121830 - p*1.459840e-3 + 1.321430/(p+10.23327)
K0(p) = 77.37037 - p*0.489282 + 623.451/(p+16.32097)
DK0(p) = 3.103759 + p*0.0249499 - p**2*0.00182331 + p**3*4.035088e-5
DKI(p) = 2.797180 - p*0.0107957 + p**2*0.00324248 - p**3*1.219298e-4

KD(t,p) = K0(p)* (TK(p)/t + t/TK(p) + DK0(p))

# Kerrisk 1:3.4
KK(t,p) =\
+ 1.8501e2\
+ 6.5501e2  * t\
- 6.2602e1  * t**2\
- 2.2759e-1 * p**2\
+ 8.2703e0  * p*t

set log

plot [0.002:3] [100:]\
  x<0.5? KG(x, 36.68):0 title "Greywall" w p pt 6,\
  x>1.5? KK(x, 0.12):0 title "Kerrisk" w p pt 6,\
  '< ../../he3 he3_tcond_n 0.001:0.001:3.3 0.12' using 1:3 with lines title "he3lib"

pause -1

plot [0.002:3] [100:]\
  x<0.6? KG(x, 32.83):0 title "Greywall" w p pt 6,\
  x>1.5? KK(x, 4.60):0 title "Kerrisk" w p pt 6,\
  '< ../../he3 he3_tcond_n 0.001:0.001:3.3 4.60' using 1:3 with lines title "he3lib"

pause -1

plot [0.002:3] [100:]\
  x<0.8? KG(x, 30.33):0  title "Greywall" w p pt 6,\
  x>1.5? KK(x, 10.16):0 title "Kerrisk" w p pt 6,\
  '< ../../he3 he3_tcond_n 0.001:0.001:3.3 10.16' using 1:3 with lines title "he3lib"

pause -1

plot [0.002:3] [100:]\
  x<1.0? KG(x, 27.65):0  title "Greywall" w p pt 6,\
  x>1.5? KK(x, 20.23):0 title "Kerrisk" w p pt 6,\
  '< ../../he3 he3_tcond_n 0.001:0.001:3.3 20.23' using 1:3 with lines title "he3lib"

pause -1

plot [0.002:3] [100:]\
  x<1.3? KG(x, 26.27):0  title "Greywall" w p pt 6,\
  x>1.5? KK(x, 29.29):0 title "Kerrisk" w p pt 6,\
  '< ../../he3 he3_tcond_n 0.001:0.001:3.3 29.29' using 1:3 with lines title "he3lib"

pause -1
